# ДЗ
# 1.Создание функции для сложения чисел. Напишите функцию, которая
# принимает два числа и возвращает их сумму.

# def название ф-ции(a,b,c):
def my_sum(a, b):
    "сумма 2х чисел"
    return a+b

# print(my_sum(5,6))

# 2. Создание функции для определения четности числа.
# Напишите функцию, которая принимает число и проверяет,
# является ли оно четным.

def get_chetnoe():
    chislo = int(input("Введите число: "))
    if chislo % 2 == 0:
        print("Число четное")
    else:
        print("Число нечетное")

# get_chetnoe()

# 3. Создание функции для вывода приветствия.
# Напишите функцию, которая приветствует пользователя
# по его имени

def say_hello(name):
    print("Привет ", name)

#say_hello("Pavel")
#say_hello("Alexey")
#say_hello("Maxim")

# 4. Создание функции для поиска максимального числа.
# Напишите функцию,которая принимает список чисел
# и возвращает максимальное число из списка.

# [12,15,13,12,32,425,6,7] пример

def get_max(my_list):
    l_list = len(my_list) # длина списка
    a = my_list[0]
    for i in my_list:
        if i > a:
            a = i
    print(a)
# Кортеж (1,3,4,5,6)
# Словарь {a:1, b:2, c:3}

# get_max({'a':1, 'b':2, 'c':3})
# print(max({'a':1, 'b':2, 'c':3}))
